// #pragma once
#include "AirTs.h"

AirTs::AirTs() {
    setType(vhclType::AIR);
    setName("воздушное транспортное средство");
    raceEst();   
}
AirTs::~AirTs() {

}
void AirTs::setCoef(int Koef)  {
    this->DistCoef = static_cast<double>(Koef);

        /*  однако в условии неточность описания для ТС
        например для "Метлы" написано что коэффициент увеличивается на 1% за каждую 1000 едениц расстояния
        то есть это не линейная велечина:
        0   -   1`000 у.е    =   1`000 у.е. (т.е. 0%)
        1`000 - 2`000 у.е.    =   990 у.е. (1%)
        2`000 - 3`000 у.е.    =   980 у.е. (2%)
        3`000 - 4`000 у.е.    =   970 у.е. (3%)        
        4`000 - 5`000 у.е.    =   960 у.е. (4%)
        в итоге при нелинейном коэффициенте при итоговой дистанции 4`500 должно быть 4`420 у.е. 
        и соответсвенно скорость 221 у.е дистанции / ед. времени

        так же наблюдается у "Ковёр-самолета", но там коэффициент к тому же еще и понижается при дистаниции более 10`000

        незначительная неточность в условии, но это вопрос к геймдизайнеру
    */ 
}

void AirTs::raceEst()   {
    this->finishTime = distance*((100 - AirTs::getCoef())*0.01)/speed;
}

double AirTs::getCoef() {
    return DistCoef;
}